In [38]:
import pandas as pd

dados = pd.read_excel('dados.xlsx')

showDados = dados.shape
print(showDados)

dados.head()

(10, 2)

   números letras
0      1.0      a
1      2.0      b
2      3.0      c
3      4.0      d
4      5.0      e

In [43]:
import pandas as pd

dados2 = pd.read_csv('census.csv')

showDados2 =dados2.shape

print(showDados2)
dados2.head(30162)

(30162, 16)

,Unnamed: 0,age,workclass,final.weight,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loos,hour.per.week,native.country,income
0,1,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,2,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,3,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,4,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,5,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30157,32557,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
30158,32558,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
30159,32559,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
30160,32560,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
30161,32561,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [26]:
alunos = {'Nome':['Marcelo','Lucas','Cynthia','Helena'],
 'Media':[4,7,5.5,9],
 'Status':['Reprovado','Aprovado','Reprovado','Aprovado']}

df1 = pd.DataFrame(alunos)

showDados = df1.shape

# print(df1.head())

# print(df1.describe())

# print(df1[['Nome']])

print(df1.loc[1:3])
print(df1.loc[df1['Status'] == 'Aprovado'])

print(df1.loc[df1['Media'] < 7.0])

exame = df1.loc[df1['Media'] < 7.0]
print(exame)

exame = df1[['Nome','Media']].loc[df1['Media'] < 7.0]
print(exame)

      Nome  Media     Status
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado
     Nome  Media    Status
1   Lucas    7.0  Aprovado
3  Helena    9.0  Aprovado
      Nome  Media     Status
0  Marcelo    4.0  Reprovado
2  Cynthia    5.5  Reprovado
      Nome  Media     Status
0  Marcelo    4.0  Reprovado
2  Cynthia    5.5  Reprovado
      Nome  Media
0  Marcelo    4.0
2  Cynthia    5.5

In [28]:
s1 = pd.Series([2,5,3,34,54,23,1,16])
print(s1)

0     2
1     5
2     3
3    34
4    54
5    23
6     1
7    16
dtype: int64

In [29]:
import numpy as np
array1 = np.array([2,5,3,34,54,23,1,16])
s2 = pd.Series(array1)
print(s2)

0     2
1     5
2     3
3    34
4    54
5    23
6     1
7    16
dtype: int64

In [30]:
s3 = df1['Nome']
print(s3)
type(s3)

0    Marcelo
1      Lucas
2    Cynthia
3     Helena
Name: Nome, dtype: object

pandas.core.series.Series

In [37]:
dados.rename(columns={"números":"nr","letras":"ltr"})

     nr ltr
0   1.0   a
1   2.0   b
2   3.0   c
3   4.0   d
4   5.0   e
5   6.0   f
6   7.0   g
7   8.0   h
8   9.0   i
9  10.0   j

In [44]:
dados.rename(columns={"nr":"números","ltr":"letras"},inplace=True)

In [45]:
dados['letras'].value_counts()

a    1
b    1
c    1
d    1
e    1
f    1
g    1
h    1
i    1
j    1
Name: letras, dtype: int64

In [46]:
dados.drop('números',axis=1,inplace=True)
print(dados)

  letras
0      a
1      b
2      c
3      d
4      e
5      f
6      g
7      h
8      i
9      j

In [47]:
teste = dados.dropna()

In [48]:
nulos = dados.isnull()
print(nulos)

   letras
0   False
1   False
2   False
3   False
4   False
5   False
6   False
7   False
8   False
9   False

In [49]:
qtdnulos = dados.isnull().sum()
print(qtdnulos)

letras    0
dtype: int64

In [50]:
len(dados['letras'])

10

In [53]:
dados['letras'].fillna('semdados',inplace = True)
print(dados)

  letras
0      a
1      b
2      c
3      d
4      e
5      f
6      g
7      h
8      i
9      j